"""
Command const ids
"""


class DwgbCmdConsts(object):
    """ Константы пакета классов """

    # Команда админки хранилища
    ADMIN_STORAGE = 20

    # Команда админки активности
    ADMIN_ACTIVITY = 21

    # Команда газеты
    PAPPER = 40

    # Команда проверки баланса
    BALANCE = 50

    # Команда отображения хранилища
    BARABAN = 70

    # Команда отображения хранилища
    STORAGE = 100

    # Команда отображения кнопок
    BUTTONS = 150

    # Команда учета передачи золота
    TRANSFERGOLD = 200

    # Команда справки
    HELP = 250

    # Команда учета передачи предмета
    TRANSFERITEM = 300

    # Команда выдачи бафа
    GETBAF = 400

    # Команда выдачи предмета
    GETITEM = 500

    # Команда учета профиля
    SAVEPROFILE = 600

    # Команда учета профиля
    CONVERT = 700

    # Скупщик
    TRADER = 800

    # Скупщик
    FLOODER = 900